export const errorMessages = {
  name: "Ім'я повинно містити від 3 до 16 символів і не повинно включати жодних спеціальних символів!",
  surname:
    'Прізвище повинно містити від 3 до 16 символів і не повинно включати жодних спеціальних символів!',
  email: 'Це повинна бути дійсна адреса електронної пошти!',
  password:
    'Пароль повинен містити від 8 до 20 символів і включати принаймні 1 літеру, 1 цифру та 1 спеціальний символ!',
  confirmPassword: 'Паролі не збігаються!',
  city: 'Це повинно бути дійсне місто!',
  tel: 'Це повинен бути дійсний номер телефону!',
};
